Autodesk.Revit.UI.Macros.UIDocumentMacroOptions
The document macro options.
Since:
2014
Since:
2014

Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.EnableMacros
The option to enable macros in the document.

Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.DisableMacros
The option to disable macros in the document.

Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.Prompt
To prompt a dialog to ask the options during document opening.